agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	fs_file_t_init(&file);
	error = fs_open(&file, SD_RECORDING_PATH,
			FS_O_CREATE | FS_O_WRITE | FS_O_TRUNC);
	if (error != 0) {
		mic_clocks_stop();
		sd_mount_result = error;
		sd_ready = false;
		recording_on_sd = false;
		return error;
	}

	recorded_samples = 0U;
	recorded_peak = 0U;
	recording_absolute_sum = 0U;
	recording_on_sd = true;
	recording_stopped_by_button = false;

	error = i2s_configure(i2s, I2S_DIR_RX, &config);
	if (error != 0) {
		mic_clocks_stop();
		(void)fs_close(&file);
		return error;
	}

	settle_elapsed = k_uptime_get() - clocks_started_at;
	if (settle_elapsed < MIC_POWERUP_BUDGET_MS) {
		k_msleep(MIC_POWERUP_BUDGET_MS - (int32_t)settle_elapsed);
	}
#if PENDANT_MIC_ELECTRICAL_PROBE
	probe_mic_data_driver();
#endif
	printk("I2S mic: bclk_hz=%u lrclk_hz=%u pcm_rate_hz=%u mode=slave "
	       "gain=%ux shift=%u storage=microSD-live\n",
	       16000000U / MIC_BCLK_TOP, 16000000U / MIC_LRCLK_TOP,
	       SAMPLE_RATE, MIC_GAIN, MIC_SAMPLE_SHIFT);

	error = i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_START);
	if (error != 0) {
		mic_clocks_stop();
		(void)fs_close(&file);
		return error;
	}

	printk("I2S mic live: sample_limit=%u requested=%u\n",
	       (uint32_t)effective_sample_limit, (uint32_t)sample_limit);

	while (sample_index < effective_sample_limit) {
		void *block;
		size_t size;

		error = i2s_read(i2s, &block, &size);
		if (error != 0) {
			printk("I2S mic read failed: samples=%u error=%d\n",
			       (uint32_t)sample_index, error);
			(void)i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
			k_msleep(MIC_STOP_SETTLE_MS);
			mic_clocks_stop();
			(void)fs_close(&file);
			return error;
		}

		int32_t *raw = block;
		size_t raw_frames = size / sizeof(int32_t);

		if (block_index == 0U) {
			int32_t raw_min = INT32_MAX;
			int32_t raw_max = INT32_MIN;

			for (size_t index = 0U; index < raw_frames; ++index) {
				raw_min = MIN(raw_min, raw[index]);
				raw_max = MAX(raw_max, raw[index]);
			}
			printk("I2S mic raw block0: words=%u min=%d max=%d "
			       "w0=%08x w1=%08x w2=%08x w3=%08x\n",
			       (uint32_t)raw_frames, raw_min, raw_max,
			       (unsigned int)raw[0], (unsigned int)raw[1],
			       (unsigned int)raw[2], (unsigned int)raw[3]);
		}

		if (block_index < MIC_STARTUP_SKIP_BLOCKS) {
			++block_index;
			k_mem_slab_free(&mic_rx_slab, block);
			clear_button_events();
			continue;
		}
		++block_index;

		if (!led_started) {
			/* Light the cue only once audio is being kept. */
			gpio_pin_set_dt(&led, 1);
			next_led_toggle = k_uptime_get() + 250;
			led_started = true;
		}

		size_t out_frames = raw_frames / MIC_DECIMATION;

		out_frames = MIN(out_frames,
				 effective_sample_limit - sample_index);

		for (size_t frame = 0U; frame < out_frames; ++frame) {
			/*
			 * Each RX word is a right-aligned, sign-extended
			 * 24-bit sample; the SPH0645's 18 significant bits
			 * occupy the top of that window.  Average adjacent
			 * frames (crude low-pass) while halving the rate,
			 * then scale 24-bit down to 16-bit.
			 */
			int32_t first =
				raw[frame * MIC_DECIMATION] >> MIC_SAMPLE_SHIFT;
			int32_t second =
				raw[frame * MIC_DECIMATION + 1U] >>
				MIC_SAMPLE_SHIFT;

			if (!slew_primed) {
				slew_prev = first;
				slew_primed = true;
			}
			int32_t delta = first - slew_prev;

			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			first = slew_prev;
			delta = second - slew_prev;
			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			second = slew_prev;

			int32_t sample = ((first + second) / 2) >> 8;

			/* DC blocker: the SPH0645 sits about 5% off center.
			 * Warm-start on the first frame so the standing
			 * offset does not enter as an audible step.
			 */
			if (!hpf_primed) {
				hpf_prev_in = sample;
				hpf_primed = true;
			}
			int32_t filtered = sample - hpf_prev_in +
				(int32_t)(((int64_t)MIC_HPF_COEFF_Q15 *
					   hpf_prev_out) >> 15);
			hpf_prev_in = sample;
			hpf_prev_out = filtered;

			int32_t amplified = filtered * MIC_GAIN;

			amplified = CLAMP(amplified, INT16_MIN, INT16_MAX);

			int32_t absolute =
				amplified < 0 ? -amplified : amplified;

			mic_stage_samples[stage_frames] = (int16_t)amplified;
			if (++stage_frames == MIC_STAGE_FRAMES) {
				live_write_error = write_pcm_frames(
					&file, mic_stage_samples,
					MIC_STAGE_FRAMES);
				stage_frames = 0U;
				++sd_flush_count;
				if (live_write_error != 0) {
					break;
				}
			}
			minimum_sample = MIN(minimum_sample,
					     (int16_t)amplified);
			maximum_sample = MAX(maximum_sample,
					     (int16_t)amplified);
			square_sum += (uint64_t)((int64_t)amplified *
						 amplified);
			if (have_previous_sample &&
			    ((previous_sample < 0 && amplified >= 0) ||
			     (previous_sample >= 0 && amplified < 0))) {
				++zero_crossings;
			}
			previous_sample = (int16_t)amplified;
			have_previous_sample = true;
			recorded_peak = MAX(recorded_peak,
					    (uint16_t)MIN(absolute,
							  UINT16_MAX));
			recording_absolute_sum += (uint32_t)absolute;

			++sample_index;
		}

		recorded_samples = sample_index;
		k_mem_slab_free(&mic_rx_slab, block);
		if (live_write_error != 0) {
			printk("I2S mic live SD write failed: %d\n",
			       live_write_error);
			(void)i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
			k_msleep(MIC_STOP_SETTLE_MS);
			mic_clocks_stop();
			(void)fs_close(&file);
			sd_ready = false;
			sd_mount_result = live_write_error;
			return live_write_error;
		}
		if (sample_index >= next_trace_sample) {
			uint32_t rms = integer_square_root(
				square_sum / sample_index);

			printk("I2S mic live: samples=%u mean=%u peak=%u "
			       "rms=%u min=%d max=%d zero_crossings=%u\n",
			       recorded_samples,
			       (uint32_t)(recording_absolute_sum /
					  recorded_samples),
			       recorded_peak, rms, minimum_sample,
			       maximum_sample, zero_crossings);
			next_trace_sample += SAMPLE_RATE;
		}

		if (k_uptime_get() >= next_led_toggle) {
			gpio_pin_toggle_dt(&led);
			next_led_toggle = k_uptime_get() + 250;
		}

