agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	/* Solid LED while the modem registers and establishes the LTE session. */
	gpio_pin_set_dt(&led, 1);
	error = pendant_cloud_init();
	gpio_pin_set_dt(&led, 0);
	if (error != 0) {
		printk("LTE initialization failed: %d\n", error);
		audio_cycle_result = error;
		show_error();
	}

	if (CONFIG_PENDANT_BOOT_AGENT_JOB_ID[0] != '\0') {
		printk("BOOT_AGENT_REPLY_TEST_BEGIN job=%s\n",
		       CONFIG_PENDANT_BOOT_AGENT_JOB_ID);
		error = pendant_cloud_set_job_id_for_diagnostic(
			CONFIG_PENDANT_BOOT_AGENT_JOB_ID);
		if (error == 0) {
			error = pendant_cloud_wait_for_agent_reply(
				PENDANT_CLOUD_REPLY_AUDIO_PATH);
		}
		if (error == 0 &&
		    pendant_cloud_reply_format ==
			    PENDANT_CLOUD_AUDIO_OGG_OPUS) {
			struct pendant_opus_stats decode_stats;

			error = pendant_opus_decode_file(
				PENDANT_CLOUD_REPLY_AUDIO_PATH,
				PENDANT_CLOUD_REPLY_PCM_PATH,
				audio_workspace, sizeof(audio_workspace),
				&decode_stats);
		}
		printk("BOOT_AGENT_REPLY_TEST_END result=%d HTTP=%d "
		       "PCM bytes=%u\n",
		       error, pendant_cloud_last_http_status,
		       pendant_cloud_reply_pcm_bytes);
	}

#if PENDANT_BOOT_UPLOAD_EXISTING
	printk("Boot diagnostic: uploading existing SD recording\n");
	gpio_pin_set_dt(&led, 1);
	struct pendant_opus_stats boot_encode_stats;
	error = pendant_opus_encode_file(
		SD_RECORDING_PATH, SD_OPUS_PATH, SAMPLE_RATE,
		audio_workspace, sizeof(audio_workspace), &boot_encode_stats);
	if (error == 0) {
		error = pendant_cloud_upload_recording(
			SD_OPUS_PATH, boot_encode_stats.input_bytes, SAMPLE_RATE);
	}
	gpio_pin_set_dt(&led, 0);
	printk("Boot upload result: %d (transcribe=%d dispatch=%d HTTP=%d "
	       "PCM bytes=%u)\n",
	       error, pendant_cloud_transcribe_result,
	       pendant_cloud_dispatch_result,
	       pendant_cloud_last_http_status,
	       pendant_cloud_uploaded_pcm_bytes);
	audio_cycle_result = error;
#endif

	clear_button_events();

	while (true) {
		/* Ready: button 1 starts a new recording. */
		audio_cycle_phase = 0U;
		gpio_pin_set_dt(&led, 0);
		wait_for_button_press();

		/* Recording: blinking LED; button 1 stops recording. */
		/*
		 * LTE stays attached during recording.  The RF-off isolation
		 * was a PDM-era noise workaround; it made every cycle pay a
		 * network reattach (which could hang for minutes) before the
		 * upload could start.  The I2S capture path buffers deeply
		 * and the slew limiter absorbs coupled impulses.
		 */
		audio_cycle_phase = 1U;
		error = record_microphone(i2s, MAX_RECORD_SAMPLE_COUNT);
		gpio_pin_set_dt(&led, 0);
		audio_cycle_phase = 2U;
		if (error != 0) {
			printk("Microphone recording failed: %d\n", error);
			audio_cycle_result = error;
			flash_led(3U, 120, 120);
			clear_button_events();
			continue;
		}

		/*
		 * Stopped/processing: LED stays off while the captured voice goes
		 * to the relay and the Mac prepares its spoken response.
		 */
		audio_cycle_phase = 3U;
		struct pendant_opus_stats encode_stats;

		error = pendant_opus_encode_file(
			SD_RECORDING_PATH, SD_OPUS_PATH, SAMPLE_RATE,
			audio_workspace, sizeof(audio_workspace), &encode_stats);
		if (error != 0) {
			printk("Opus recording compression failed: %d\n", error);
			audio_cycle_result = error;
			flash_led(4U, 100, 100);
			continue;
		}
		/* Make the new task visible on the dashboard right away;
		 * the audio itself follows in the next request.
		 */
		int announce_error = pendant_cloud_announce_recording(
			recorded_samples * (uint32_t)sizeof(int16_t),
			SAMPLE_RATE);
		if (announce_error != 0) {
			printk("Recording announce failed: %d\n",
			       announce_error);
		}
		error = pendant_cloud_upload_recording(
			SD_OPUS_PATH, encode_stats.input_bytes, SAMPLE_RATE);
		if (error != 0) {
			printk("Internet voice cycle failed: %d "
			       "(transcribe=%d dispatch=%d HTTP=%d)\n",
			       error, pendant_cloud_transcribe_result,
			       pendant_cloud_dispatch_result,
			       pendant_cloud_last_http_status);
			audio_cycle_result = error;
			flash_led(5U, 100, 100);
			continue;
		}

		audio_cycle_phase = 4U;
		gpio_pin_set_dt(&led, 0);
		error = pendant_cloud_wait_for_agent_reply(
			PENDANT_CLOUD_REPLY_AUDIO_PATH);
		if (error == -ECANCELED) {
			/* Button pressed while polling: skip this reply and
			 * go straight back to Ready for a new recording.
			 */
			printk("Reply wait canceled by button press\n");
			finish_button_press();
			continue;
		}
		const char *reply_pcm_path = PENDANT_CLOUD_REPLY_AUDIO_PATH;
		if (pendant_cloud_reply_format ==
		    PENDANT_CLOUD_AUDIO_OGG_OPUS) {
			struct pendant_opus_stats decode_stats;

			error = pendant_opus_decode_file(
				PENDANT_CLOUD_REPLY_AUDIO_PATH,
				PENDANT_CLOUD_REPLY_PCM_PATH,
				audio_workspace, sizeof(audio_workspace),
				&decode_stats);
			if (error != 0) {
				printk("Opus reply decode failed: %d\n", error);
				audio_cycle_result = error;
				flash_led(8U, 100, 100);
				continue;
			}
			pendant_cloud_reply_pcm_bytes =
				decode_stats.output_bytes;
			pendant_cloud_reply_sample_rate =
				PENDANT_OPUS_REPLY_SAMPLE_RATE;
			reply_pcm_path = PENDANT_CLOUD_REPLY_PCM_PATH;
		}
		if (error != 0) {
			printk("Agent reply download failed: %d (HTTP=%d)\n",
			       error, pendant_cloud_last_http_status);
			audio_cycle_result = error;
			flash_led(7U, 100, 100);
			continue;
		}

		/*
		 * Repeating pairs of short flashes mean the agent response is ready.
		 * A deliberate third button press starts Bluetooth playback.
		 */
		audio_cycle_phase = 5U;
		clear_button_events();
		wait_for_reply_playback_press();

		/* Playing: LED remains solid for the duration of agent speech. */
		audio_cycle_phase = 6U;
		gpio_pin_set_dt(&led, 1);
		int telemetry_error =
			pendant_cloud_report_playback_started();

		if (telemetry_error != 0) {
			printk("Playback-start telemetry failed: %d\n",
			       telemetry_error);
		}
		error = play_agent_reply(i2s, reply_pcm_path);
		telemetry_error =
			pendant_cloud_report_playback_result(error);
		if (telemetry_error != 0) {
			printk("Playback-result telemetry failed: %d\n",
			       telemetry_error);
		}
		gpio_pin_set_dt(&led, 0);
		if (error != 0) {
			printk("Agent reply I2S playback failed: %d\n", error);
			audio_cycle_result = error;
			flash_led(9U, 100, 100);
			continue;
		}

		audio_cycle_phase = 7U;
		audio_cycle_result = 0;
		for (unsigned int flash = 0U; flash < 3U; ++flash) {
			gpio_pin_set_dt(&led, 1);
			k_msleep(180);
			gpio_pin_set_dt(&led, 0);
			k_msleep(180);
		}
		k_msleep(200);
	}
}
